jpnorair/OpenTag/include/board/stm32l1xx/board_Jupiter_R1.h
    GPIOA->OTYPER   = (1 << (9)) | (1 << (11)) | (1 << 14);
    
    GPIOA->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (4*2)) \
                    | (GPIO_OSPEEDR_10MHz << (5*2)) \
                    | (GPIO_OSPEEDR_10MHz << (6*2)) \
                    | (GPIO_OSPEEDR_10MHz << (7*2)) \
                    | (GPIO_OSPEEDR_40MHz << (8*2)) \
                    | (GPIO_OSPEEDR_2MHz  << (9*2)) \
                    | (GPIO_OSPEEDR_2MHz  << (10*2)) \
                    | (GPIO_OSPEEDR_40MHz << (11*2)) \
                    | (GPIO_OSPEEDR_40MHz << (12*2)) \
                    | (GPIO_OSPEEDR_40MHz << (13*2)) \
                    | (GPIO_OSPEEDR_40MHz << (14*2));
    
    
    GPIOA->PUPDR    = (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                    | (1 << (9*2)) | (1 << (10*2)) \
                    | (1 << (11*2)) | (1 << (12*2)) \
                    | (1 << (13*2)) | (2 << (14*2)) \
                    | (1 << (15*2));
    
    GPIOA->AFR[0]   = (5 << ((BOARD_RFSPI_MOSIPINNUM)*4)) \
                    | (5 << ((BOARD_RFSPI_MISOPINNUM)*4)) \
                    | (5 << ((BOARD_RFSPI_SCLKPINNUM)*4));
    /* 
    GPIOA->AFR[1]   = (7 << ((BOARD_HCOMUART_TXPINNUM-8)*4)) \
                    | (7 << ((BOARD_HCOMUART_RXPINNUM-8)*4));
    */
    GPIOA->AFR[1]   = (10 << ((BOARD_HCOMUSB_DMPINNUM-8)*4)) \
                    | (10 << ((BOARD_HCOMUSB_DPPINNUM-8)*4));
    /* */

    /// Configure Port B IO.
    /// Port B is used for external (module) IO.
    // - B0:2 are radio IRQs, which are input HiZ by startup default
    // - B3: is the TRACE pin, which is a pullup input for test
    // - B4:9 are USER IOBUS pins, which are input HiZ by startup default
    // - B10:11 are the HCOM I2C pins, which input HiZ by startup default
    // - B12:15 are the ADC pins, which are set to floating ADC (HiZ)
    GPIOB->MODER    = (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ANALOG << (13*2)) \
                    | (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    GPIOB->OTYPER   = (1 << (10)) | (1 << (11));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_40MHz << (3*2)) \
                    | (GPIO_OSPEEDR_10MHz << (4*2)) \
                    | (GPIO_OSPEEDR_10MHz << (5*2)) \
                    | (GPIO_OSPEEDR_10MHz << (6*2)) \
                    | (GPIO_OSPEEDR_10MHz << (7*2)) \
                    | (GPIO_OSPEEDR_10MHz << (8*2)) \
                    | (GPIO_OSPEEDR_10MHz << (9*2)) \
                    | (GPIO_OSPEEDR_2MHz << (10*2)) \
                    | (GPIO_OSPEEDR_2MHz << (11*2)) \
                    | (GPIO_OSPEEDR_10MHz << (12*2)) \
                    | (GPIO_OSPEEDR_10MHz << (13*2)) \
                    | (GPIO_OSPEEDR_10MHz << (14*2)) \
                    | (GPIO_OSPEEDR_10MHz << (15*2));

    //GPIOB->PUPDR    = (1 << (10*2)) | (1 << (11*2));
    
    
    /// Configure Port C IO.
    /// Port C is used only for USB sense and 32kHz crystal driving
    // - C13 is Attach Detect, a grounded output
    // - C14:15 are 32kHz crystal driving, set to ALT
    GPIOC->MODER    = (GPIO_MODER_OUT << (13*2)) \
                    | (GPIO_MODER_OUT << (14*2)) \
                    | (GPIO_MODER_ALT << (15*2));
    
    // Assert Port H as HiZ
    GPIOH->MODER    = (GPIO_MODER_IN << (0*2))
                    | (GPIO_MODER_IN << (1*2));
    
    /// Configure Port H for Crystal Bypass
    /// By default it is set to HiZ input.  It is changed on-demand in FW
    //GPIOH->MODER    = (GPIO_MODER_ALT << (0*2))
    //                | (GPIO_MODER_OUT << (1*2));
    //RCC->CR   |= RCC_CR_HSEBYP;
    
    // Disable GPIOC and GPIOH, they are never altered after this.
    RCC->AHBENR    = _AHBENR_RUNTIME;
}





static inline void BOARD_RFSPI_CLKON(void) {
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
}

static inline void BOARD_RFSPI_CLKOFF(void) {
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_OUT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_IN << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_OUT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
}




static inline void BOARD_STOP(ot_int code) {
/// code comes from sys_sig_powerdown, but it is usually 0-3.
/// For all STM32L devices, 3 is full-idle and 2 is radio-active-idle.  
/// Those are the only modes that should call this inline function.

    static const ot_u16 stop_flags[2] = {  
        (PWR_CR_LPSDSR | PWR_CR_CSBF), (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF) };
        
    static const ot_u32 rcc_flags[2] = {
        0xFFFFFFFF, ~(RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN) };
        
    static const ot_u32 b_moder[2] = {
        0xFFFFFC0, 0xFFFFFFFF };
    
    ot_u16 scratch;
    
    code &= 1;
    
#   if defined(__RELEASE__)
      //GPIOA->MODER    = 0xFFFFFFFF;
      //GPIOB->MODER    = b_moder[code];
      //GPIOA->PUPDR    = 0;
      //GPIOB->PUPDR    = 0;      //can be ignored, always 0
      RCC->AHBENR    &= rcc_flags[code];
#   endif

    SysTick->CTRL = 0;
    SCB->SCR   |= SCB_SCR_SLEEPDEEP;
    scratch     = PWR->CR;
    scratch    &= ~(PWR_CR_DBP | PWR_CR_PDDS | PWR_CR_LPSDSR);
    scratch    |= stop_flags[code];
    PWR->CR     = scratch;
    
    EXTI->PR    = 0;
    gptim_stop_chrono();
    platform_enable_interrupts();
    
    __WFI();
    
    // On Wakeup (from STOP) clear flags & re-enable backup register area
    PWR->CR |= (PWR_CR_DBP | PWR_CR_CWUF | PWR_CR_CSBF);
    
    // On wakeup, immediately reset SLEEPDEEP bit
    SCB->SCR &= ~((ot_u32)SCB_SCR_SLEEPDEEP);
    
    // Re-enable ports
#   if defined(__RELEASE__)
      RCC->AHBENR    |= (RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN);
      //GPIOA->PUPDR    = GPIOA_PUPDR_DEFAULT;
      //GPIOB->PUPDR    = GPIOB_PUPDR_DEFAULT;    //can be ignored, always 0
      //GPIOA->MODER    = GPIOA_MODER_DEFAULT;
      //GPIOB->MODER    = GPIOB_MODER_DEFAULT;
#   endif
}







static inline void BOARD_PORT_STANDBY() {

    // JTAG/SWD Interface: Keep Alive
    
    // Pushbutton Interface: Keep Alive
    
